---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ScheduleFilterParam
source: html/5f289f39-a6b9-b568-c4ab-b8d4a36cb289.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ScheduleFilterParam Property

"Filter"

## Syntax (C#)
```csharp
public static ForgeTypeId ScheduleFilterParam { get; }
```